Grammars/sem6.org
#+LATEX_HEADER:\usepackage{amsmath}
#+LATEX_HEADER:\usepackage{esint}
#+LATEX_HEADER:\usepackage[english,russian]{babel}
#+LATEX_HEADER:\usepackage{mathtools}
#+LATEX_HEADER:\usepackage{amsthm}
#+LATEX_HEADER:\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}
#+LANGUAGE: ru
#+OPTIONS: ':t
#+OPTIONS: toc:nil

* Задача 1
Вычислить функции FIRST и FOLLOW для всех нетерминалов грамматики `Even`:
#+begin_export latex
\begin{equation}
\begin{cases}
S \rightarrow BaBaS | B, \\
B \rightarrow bB | \varepsilon.
\end{cases}
\end{equation}
#+end_export
** Решение
#+begin_export latex
Найдём FIRST(B). Первое правило даёт нам, что $b \in$ FIRST(B), второе -- что $\varepsilon \in$ FIRST(B),
таким образом, $FIRST(B) = \{\varepsilon, b\}$. Второе правило для S даёт нам, что $\varepsilon, b \in$ FIRST(S),
первое -- то же самое и вдобавок, $a \in$ FIRST(S), поскольку из первого нетерминала этого
правила $B$ выводима пустая цепочка.

Вычислим FOLLOW(S). Поскольку в грамматике нет правил, в которых за S следует какой-либо символ грамматики, но
есть правило $S \rightarrow BaBaS$, в котором S -- самый правый символ, то FOLLOW(S) = $\{\$\}$. Теперь вычислим
FOLLOW(B). В грамматике есть правило $S \rightarrow B$, из которого следует, что $\$ \in$ FOLLOW(B). Из правила
$S \rightarrow BaBaS$ следует также, что $a \in$ FOLLOW(B). Таким образом:
\begin{equation}
\begin{cases}
FIRST(S) = \{\varepsilon, a, b\}, \\
FIRST(B) = \{\varepsilon, b\}, \\
FOLLOW(S) = \{\$\}, \\
FOLLOW(B) = \{a, \$\}.
\end{cases}
\end{equation}
#+end_export
* Задача 2
Привести грамматику `Even` к LL(1)-грамматике и построить для этой грамматики LL(1)-анализатор.
** Решение
 Грамматика `Even` не является LL(1)-грамматикой, поскольку находясь в начальном состоянии и видя,
 что входной символ $b$, автомат не сможет выбрать из двух правил для $S$ нужное. Приведём эту
 грамматику к LL(1)-грамматике, добавив новое правило:
 #+begin_export latex
 \begin{equation}
 \begin{cases}
 S \rightarrow BC, \\
 B \rightarrow bB | \varepsilon, \\
 C \rightarrow aBaS | \varepsilon.
 \end{cases}
 \end{equation}
 Пересчитаем множества FIRST и FOLLOW:
 \begin{equation*}
 \begin{cases}
 FIRST(S) = \{\varepsilon, a, b\}, \\
 FIRST(B) = \{\varepsilon, b\}, \\
 FIRST(C) = \{\varepsilon, a\}, \\
 FOLLOW(S) = \{\$\}, \\
 FOLLOW(B) = \{a, \$\}, \\
 FOLLOW(C) = \{\$\}.
 \end{cases}
 \end{equation*}
 #+end_export
 Проверим, что получившаяся грамматика действительно будет LL(1)-грамматикой. Рассмотрим пару
 продукций $B \rightarrow bB | \varepsilon$. Для этой пары продукций:
 1. Не существует терминала, с которого бы начинались строки, порождаемые правыми частями обеих продукций.
 2. Только одна из этих продукций порождает пустую строку.
 3. Строка $bB$ не порождает ни одной строки, начинающейся с символа из FOLLOW(B).
 Аналогичные три условия выполняются и для продукций $C \rightarrow aBaS | \varepsilon$.

 Построим таблицу разбора для полученной грамматики:
 |------------+-----------------------------+--------------------+-----------------------------|
 | Нетерминал | Входной символ              |                    |                             |
 |            | $a$                         | $b$                | $                           |
 |------------+-----------------------------+--------------------+-----------------------------|
 | $S$        | $S \rightarrow BC$          | $S \rightarrow BC$ | $S \rightarrow BC$          |
 | $B$        | $B \rightarrow \varepsilon$ | $B \rightarrow bB$ | $B \rightarrow \varepsilon$ |
 | $C$        | $C \rightarrow aBaS$        |                    | $C \rightarrow \varepsilon$ |
 |------------+-----------------------------+--------------------+-----------------------------|
Здесь и далее пустые ячейки таблицы означают состояние ошибки.
* Задача 3
Привести грамматику
#+begin_export latex
\begin{equation}
\begin{cases}
S \rightarrow aAB | ac, \\
A \rightarrow Aa | b, \\
B \rightarrow Bb | c | \varepsilon
\end{cases}
\end{equation}
#+end_export
к LL(1)-грамматике, построить LL(1)-анализатор и продемонстрировать его работу на слове
$\omega = abaa$.
** Решение
Входная грамматика не является LL(1)-грамматикой, поскольку:
1. Содержит леворекурсивные правила для нетерминалов $A$ и $B$.
2. Содержит пару продукций $S \rightarrow aAB | ac$, правые части которых начинаются с одного и того же символа.
Преобразуем эту грамматику к LL(1)-грамматике:
#+begin_export latex
\begin{equation}
\begin{cases}
S \rightarrow aC, \\
C \rightarrow AB | c, \\
A \rightarrow bD, \\
B \rightarrow cE | E, \\
D \rightarrow aD | \varepsilon, \\
E \rightarrow bE | \varepsilon.
\end{cases}
\end{equation}
#+end_export
Рассчитаем множества FIRST и FOLLOW для символов грамматики:
#+begin_export latex
\begin{equation*}
\begin{cases}
FIRST(S) = \{a\}, \\
FIRST(C) = \{b, c\}, \\
FIRST(A) = \{b\}, \\
FIRST(B) = \{b, c, \varepsilon\}, \\
FIRST(D) = \{a, \varepsilon\}, \\
FIRST(E) = \{b, \varepsilon\}, \\
FOLLOW(S) = \{\$\}, \\
FOLLOW(C) = \{\$\}, \\
FOLLOW(A) = \{b, c, \$\}, \\
FOLLOW(B) = \{\$\}, \\
FOLLOW(D) = \{b, c, \$\}, \\
FOLLOW(E) = \{\$\}.
\end{cases}
\end{equation*}
#+end_export
Используя эти множества, можно построить таблицу разбора:
|------------+--------------------+-----------------------------+-----------------------------+-----------------------------|
| Нетерминал | Входной символ     |                             |                             |                             |
|            | $a$                | $b$                         | $c$                         | $                           |
|------------+--------------------+-----------------------------+-----------------------------+-----------------------------|
| $S$        | $S \rightarrow aC$ |                             |                             |                             |
| $C$        |                    | $C \rightarrow AB$          | $C \rightarrow c$           |                             |
| $A$        |                    | $A \rightarrow bD$          |                             |                             |
| $B$        |                    | $B \rightarrow E$           | $B \rightarrow cE$          | $B \rightarrow E$           |
| $D$        | $D \rightarrow aD$ | $D \rightarrow \varepsilon$ | $D \rightarrow \varepsilon$ | $D \rightarrow \varepsilon$ |
| $E$        |                    | $E \rightarrow bE$          |                             | $E \rightarrow \varepsilon$ |
|------------+--------------------+-----------------------------+-----------------------------+-----------------------------|

Рассмотрим работу этого автомата на примере строки $\omega = abaa$:
|-------------------------+------+-------+-------------------------------------|
| Прочитанная часть входа | Стек | Вход  | Действие                            |
|-------------------------+------+-------+-------------------------------------|
|                         | S$   | abaa$ |                                     |
|                         | aC$  | abaa$ | вывести $S \rightarrow aC$          |
| a                       | C$   | baa$  | прочитать $a$                       |
| a                       | AB$  | baa$  | вывести $C \rightarrow AB$          |
| a                       | bDB$ | baa$  | вывести $A \rightarrow bD$          |
| ab                      | DB$  | aa$   | прочитать $b$                       |
| ab                      | aDB$ | aa$   | вывести $D \rightarrow aD$          |
| aba                     | DB$  | a$    | прочитать $a$                       |
| aba                     | aDB$ | a$    | вывести $D \rightarrow aD$          |
| abaa                    | DB$  | $     | прочитать $a$                       |
| abaa                    | B$   | $     | вывести $D \rightarrow \varepsilon$ |
| abaa                    | E$   | $     | вывести $B \rightarrow E$           |
| abaa                    | $    | $     | вывести $E \rightarrow \varepsilon$ |
|-------------------------+------+-------+-------------------------------------|
* Задача 4
Построить по грамматике LR(1)-анализатор и продемонстрировать его работу на слове $\omega = abab$:
#+begin_export latex
\begin{equation}
S \rightarrow SaSb | \varepsilon,
\end{equation}
#+end_export
