Grammars/sem6.tex
% Created 2020-04-26 Sun 13:36
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{amsmath}
\usepackage{esint}
\usepackage[english, russian]{babel}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage[top=0.8in, bottom=0.75in, left=0.625in, right=0.625in]{geometry}
\author{Sergey Makarov}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Sergey Makarov},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3)}, 
 pdflang={Russian}}
\begin{document}


\section{Задача 1}
\label{sec:org9b70f6d}
Вычислить функции FIRST и FOLLOW для всех нетерминалов грамматики `Even`:
\begin{equation}
\begin{cases}
S \rightarrow BaBaS | B, \\
B \rightarrow bB | \varepsilon.
\end{cases}
\end{equation}
\subsection{Решение}
\label{sec:org19baf43}
Найдём FIRST(B). Первое правило даёт нам, что $b \in$ FIRST(B), второе -- что $\varepsilon \in$ FIRST(B),
таким образом, $FIRST(B) = \{\varepsilon, b\}$. Второе правило для S даёт нам, что $\varepsilon, b \in$ FIRST(S),
первое -- то же самое и вдобавок, $a \in$ FIRST(S), поскольку из первого нетерминала этого
правила $B$ выводима пустая цепочка.

Вычислим FOLLOW(S). Поскольку в грамматике нет правил, в которых за S следует какой-либо символ грамматики, но
есть правило $S \rightarrow BaBaS$, в котором S -- самый правый символ, то FOLLOW(S) = $\{\$\}$. Теперь вычислим
FOLLOW(B). В грамматике есть правило $S \rightarrow B$, из которого следует, что $\$ \in$ FOLLOW(B). Из правила
$S \rightarrow BaBaS$ следует также, что $a \in$ FOLLOW(B). Таким образом:
\begin{equation}
\begin{cases}
FIRST(S) = \{\varepsilon, a, b\}, \\
FIRST(B) = \{\varepsilon, b\}, \\
FOLLOW(S) = \{\$\}, \\
FOLLOW(B) = \{a, \$\}.
\end{cases}
\end{equation}
\section{Задача 2}
\label{sec:orga83ce67}
Привести грамматику `Even` к LL(1)-грамматике и построить для этой грамматики LL(1)-анализатор.
\subsection{Решение}
\label{sec:org9a9ff93}
Грамматика `Even` не является LL(1)-грамматикой, поскольку находясь в начальном состоянии и видя,
что входной символ \(b\), автомат не сможет выбрать из двух правил для \(S\) нужное. Приведём эту
грамматику к LL(1)-грамматике, добавив новое правило:
\begin{equation}
\begin{cases}
S \rightarrow BC, \\
B \rightarrow bB | \varepsilon, \\
C \rightarrow aBaS | \varepsilon.
\end{cases}
\end{equation}
Пересчитаем множества FIRST и FOLLOW:
\begin{equation*}
\begin{cases}
FIRST(S) = \{\varepsilon, a, b\}, \\
FIRST(B) = \{\varepsilon, b\}, \\
FIRST(C) = \{\varepsilon, a\}, \\
FOLLOW(S) = \{\$\}, \\
FOLLOW(B) = \{a, \$\}, \\
FOLLOW(C) = \{\$\}.
\end{cases}
\end{equation*}
Проверим, что получившаяся грамматика действительно будет LL(1)-грамматикой. Рассмотрим пару
продукций \(B \rightarrow bB | \varepsilon\). Для этой пары продукций:
\begin{enumerate}
\item Не существует терминала, с которого бы начинались строки, порождаемые правыми частями обеих продукций.
\item Только одна из этих продукций порождает пустую строку.
\item Строка \(bB\) не порождает ни одной строки, начинающейся с символа из FOLLOW(B).
\end{enumerate}
Аналогичные три условия выполняются и для продукций \(C \rightarrow aBaS | \varepsilon\).

Построим таблицу разбора для полученной грамматики:
\begin{center}
\begin{tabular}{llll}
\hline
Нетерминал & Входной символ &  & \\
 & \(a\) & \(b\) & \$\\
\hline
\(S\) & \(S \rightarrow BC\) & \(S \rightarrow BC\) & \(S \rightarrow BC\)\\
\(B\) & \(B \rightarrow \varepsilon\) & \(B \rightarrow bB\) & \(B \rightarrow \varepsilon\)\\
\(C\) & \(C \rightarrow aBaS\) &  & \(C \rightarrow \varepsilon\)\\
\hline
\end{tabular}
\end{center}
Здесь и далее пустые ячейки таблицы означают состояние ошибки.
\section{Задача 3}
\label{sec:orge2821fa}
Привести грамматику
\begin{equation}
\begin{cases}
S \rightarrow aAB | ac, \\
A \rightarrow Aa | b, \\
B \rightarrow Bb | c | \varepsilon
\end{cases}
\end{equation}
к LL(1)-грамматике, построить LL(1)-анализатор и продемонстрировать его работу на слове
\(\omega = abaa\).
\subsection{Решение}
\label{sec:orgfc8ec73}
Входная грамматика не является LL(1)-грамматикой, поскольку:
\begin{enumerate}
\item Содержит леворекурсивные правила для нетерминалов \(A\) и \(B\).
\item Содержит пару продукций \(S \rightarrow aAB | ac\), правые части которых начинаются с одного и того же символа.
\end{enumerate}
Преобразуем эту грамматику к LL(1)-грамматике:
\begin{equation}
\begin{cases}
S \rightarrow aC, \\
C \rightarrow AB | c, \\
A \rightarrow bD, \\
B \rightarrow cE | E, \\
D \rightarrow aD | \varepsilon, \\
E \rightarrow bE | \varepsilon.
\end{cases}
\end{equation}
Рассчитаем множества FIRST и FOLLOW для символов грамматики:
\begin{equation*}
\begin{cases}
FIRST(S) = \{a\}, \\
FIRST(C) = \{b, c\}, \\
FIRST(A) = \{b\}, \\
FIRST(B) = \{b, c, \varepsilon\}, \\
FIRST(D) = \{a, \varepsilon\}, \\
FIRST(E) = \{b, \varepsilon\}, \\
FOLLOW(S) = \{\$\}, \\
FOLLOW(C) = \{\$\}, \\
FOLLOW(A) = \{b, c, \$\}, \\
FOLLOW(B) = \{\$\}, \\
FOLLOW(D) = \{b, c, \$\}, \\
FOLLOW(E) = \{\$\}.
\end{cases}
\end{equation*}
Используя эти множества, можно построить таблицу разбора:
\begin{center}
\begin{tabular}{lllll}
\hline
Нетерминал & Входной символ &  &  & \\
 & \(a\) & \(b\) & \(c\) & \$\\
\hline
\(S\) & \(S \rightarrow aC\) &  &  & \\
\(C\) &  & \(C \rightarrow AB\) & \(C \rightarrow c\) & \\
\(A\) &  & \(A \rightarrow bD\) &  & \\
\(B\) &  & \(B \rightarrow E\) & \(B \rightarrow cE\) & \(B \rightarrow E\)\\
\(D\) & \(D \rightarrow aD\) & \(D \rightarrow \varepsilon\) & \(D \rightarrow \varepsilon\) & \(D \rightarrow \varepsilon\)\\
\(E\) &  & \(E \rightarrow bE\) &  & \(E \rightarrow \varepsilon\)\\
\hline
\end{tabular}
\end{center}

Рассмотрим работу этого автомата на примере строки \(\omega = abaa\):
\begin{center}
\begin{tabular}{llll}
\hline
Прочитанная часть входа & Стек & Вход & Действие\\
\hline
 & S\$ & abaa\$ & \\
 & aC\$ & abaa\$ & вывести \(S \rightarrow aC\)\\
a & C\$ & baa\$ & прочитать \(a\)\\
a & AB\$ & baa\$ & вывести \(C \rightarrow AB\)\\
a & bDB\$ & baa\$ & вывести \(A \rightarrow bD\)\\
ab & DB\$ & aa\$ & прочитать \(b\)\\
ab & aDB\$ & aa\$ & вывести \(D \rightarrow aD\)\\
aba & DB\$ & a\$ & прочитать \(a\)\\
aba & aDB\$ & a\$ & вывести \(D \rightarrow aD\)\\
abaa & DB\$ & \$ & прочитать \(a\)\\
abaa & B\$ & \$ & вывести \(D \rightarrow \varepsilon\)\\
abaa & E\$ & \$ & вывести \(B \rightarrow E\)\\
abaa & \$ & \$ & вывести \(E \rightarrow \varepsilon\)\\
\hline
\end{tabular}
\end{center}
