Grammars/sem6.org
** Решение
Введём в грамматику новый стартовый символ $S'$ и дополним её правилом $S' \rightarrow S$, получим грамматику:
#+begin_export latex
\begin{equation}
\begin{cases}
S' \rightarrow S \\
S \rightarrow SaSb \\
S \rightarrow \varepsilon.
\end{cases}
\end{equation}
#+end_export
Вычислим множества FIRST:
#+begin_export latex
\begin{equation*}
FIRST(S') = FIRST(S) = \{\varepsilon, a\}.
\end{equation*}
#+end_export
Вычислим множество ситуаций для дополненной грамматики:
#+begin_export latex
\begin{equation*}
CLOSURE(\{[S' \rightarrow \cdot S, \$]\}) = \{[S' \rightarrow \cdot S, \$],
[S \rightarrow \cdot SaSb, \$], [S \rightarrow \cdot, \$],
[S \rightarrow \cdot SaSb, a], [S \rightarrow \cdot, a]\} = I_1
\end{equation*}
\begin{equation*}
GOTO(I_1, a) = GOTO(I_1, b) = \emptyset
\end{equation*}
\begin{multline*}
GOTO(I_1, S) = CLOSURE(\{[S' \rightarrow S\cdot, \$], [S \rightarrow S\cdot aSb, \$],
[S \rightarrow S\cdot aSb, a]\}) = \\
= \{[S' \rightarrow S\cdot, \$], [S \rightarrow S\cdot aSb, \$],
[S \rightarrow S\cdot aSb, a]\} = I_2
\end{multline*}
\begin{equation*}
GOTO(I_2, S) = GOTO(I_2, b) = \emptyset
\end{equation*}
\begin{multline*}
GOTO(I_2, a) = CLOSURE(\{[S \rightarrow Sa\cdot Sb, \$], [S \rightarrow Sa\cdot Sb, a]\}) = \\
= \{[S \rightarrow Sa\cdot Sb, \$], [S \rightarrow Sa\cdot Sb, a],
[S \rightarrow \cdot SaSb, b], [S \rightarrow \cdot, a], [S \rightarrow \cdot, b],
[S \rightarrow \cdot SaSb, a]\} = I_3
\end{multline*}
\begin{equation*}
GOTO(I_3, a) = GOTO(I_3, b) = \emptyset
\end{equation*}
\begin{multline*}
GOTO(I_3, S) = CLOSURE(\{[S \rightarrow SaS\cdot b, \$], [S \rightarrow SaS\cdot b, a],
[S \rightarrow S\cdot aSb, a], [S \rightarrow S\cdot aSb, b]\}) = \\
= \{[S \rightarrow SaS\cdot b, \$], [S \rightarrow SaS\cdot b, a],
[S \rightarrow S\cdot aSb, a], [S \rightarrow S\cdot aSb, b]\} = I_4
\end{multline*}
\begin{equation*}
GOTO(I_4, S) = \emptyset
\end{equation*}
\begin{multline*}
GOTO(I_4, a) = CLOSURE(\{[S \rightarrow Sa\cdot Sb, a], [S \rightarrow Sa\cdot Sb, b]\}) = \\
= \{[S \rightarrow Sa\cdot Sb, a], [S \rightarrow Sa\cdot Sb, b],
[S \rightarrow \cdot SaSb, b], [S \rightarrow \cdot a], [S \rightarrow \cdot, b],
[S \rightarrow \cdot SaSb, a]\} = I_5
\end{multline*}
\begin{equation*}
GOTO(I_4, b) = CLOSURE(\{[S \rightarrow SaSb\cdot, a], [S \rightarrow SaSb\cdot, \$]\})
= \{[S \rightarrow SaSb\cdot, b], [S \rightarrow SaSb\cdot, \$]\} = I_6
\end{equation*}
\begin{equation*}
GOTO(I_5, a) = GOTO(I_5, b) = \emptyset
\end{equation*}
\begin{multline*}
GOTO(I_5, S) = CLOSURE(\{[S \rightarrow SaS\cdot b, a], [S \rightarrow SaS\cdot b, b],
[S \rightarrow S\cdot aSb, a], [S \rightarrow S\cdot aSb, b]\}) = \\
= \{[S \rightarrow SaS\cdot b, a], [S \rightarrow SaS\cdot b, b],
[S \rightarrow S\cdot aSb, a], [S \rightarrow S\cdot aSb, b]\} = I_7
\end{multline*}
\begin{equation*}
GOTO(I_6, S) = GOTO(I_6, a) = GOTO(I_6, b) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_7, S) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_7, a) = CLOSURE(\{[S \rightarrow Sa\cdot Sb, a], [S \rightarrow Sa\cdot Sb, b]\}) = I_5
\end{equation*}
\begin{equation*}
GOTO(I_7, b) = CLOSURE(\{[S \rightarrow SaSb\cdot, a], [S \rightarrow SaSb\cdot, b]\}) = I_8
\end{equation*}
\begin{equation*}
GOTO(I_8, S) = GOTO(I_8, a) = GOTO(I_8, b) = \emptyset
\end{equation*}
#+end_export

Теперь можно построить таблицы ACTION и GOTO LR(1)-автомата:
|-----------+--------+----+-----+------|
| Состояние | ACTION |    |     | GOTO |
|-----------+--------+----+-----+------|
|           | a      | b  | $   |    S |
|-----------+--------+----+-----+------|
|         1 | r2     |    | r2  |    2 |
|         2 | s3     |    | acc |      |
|         3 | r2     | r2 |     |    4 |
|         4 | s5     | s6 |     |      |
|         5 | r2     | r2 |     |    7 |
|         6 | r1     |    | r1  |      |
|         7 | s5     | s8 |     |      |
|         8 | r1     | r1 |     |      |
|-----------+--------+----+-----+------|
Здесь $ri$ обозначает свёртку по правилу c номером $i$, $sj$ обозначает сдвиг символа на стек
с переходом в состояние с номером $j$(и правила, и состояния нумеруются с единицы,
добавленное правило не учитывается), $acc$ обозначает принятие слова автоматом. Пустые клетки
означают состояние ошибки.

Рассмотрим работу автомата на слове $\omega = abab$:
|-----------+-------------------------+-------+------------------------------------------------|
| Стек      | Прочитанная часть входа | Вход  | Действие                                       |
|-----------+-------------------------+-------+------------------------------------------------|
| 1         |                         | abab$ | свёртка по правилу $S \rightarrow \varepsilon$ |
| 1 2       |                         | abab$ | считывание "a"                                 |
| 1 2 3     | a                       | bab$  | свёртка по правилу $S \rightarrow \varepsilon$ |
| 1 2 3 4   | a                       | bab$  | считывание "b"                                 |
| 1 2 3 4 6 | ab                      | ab$   | свёртка по правилу $S \rightarrow SaSb$        |
| 1 2       | ab                      | ab$   | считывание "a"                                 |
| 1 2 3     | aba                     | b$    | свёртка по правилу $S \rightarrow \varepsilon$ |
| 1 2 3 4   | aba                     | b$    | считывание "b"                                 |
| 1 2 3 4 6 | abab                    | $     | свёртка по правилу $S \rightarrow SaSb$        |
| 1         | abab                    | $     | свёртка по правилу $S \rightarrow \varepsilon$ |
| 1 2       | abab                    | $     | принятие строки                                |
|-----------+-------------------------+-------+------------------------------------------------|
* Задача 5
Построить по грамматике LR(1)-анализатор и продемонстрировать его работу на слове $\omega = abab$:
#+begin_export latex
\begin{equation}
\begin{cases}
S \rightarrow Ab | Ac, \\
A \rightarrow aA | b.
\end{cases}
\end{equation}
#+end_export
