Grammars/sem6.tex
\section{Задача 5}
\label{sec:orgc70028f}
Построить по грамматике LR(1)-анализатор и продемонстрировать его работу на слове \(\omega = abab\):
\begin{equation}
\begin{cases}
S \rightarrow Ab | Ac, \\
A \rightarrow aA | b.
\end{cases}
\end{equation}
\subsection{Решение}
\label{sec:org18d8e6a}
Дополним грамматику новым стартовым символом \(S'\) и правилом \(S' \rightarrow S\):
\begin{equation}
\begin{cases}
S' \rightarrow S \\
S \rightarrow Ab \\
S \rightarrow Ac \\
A \rightarrow aA \\
A \rightarrow b.
\end{cases}
\end{equation}
Вычислим множества FIRST для нетерминалов:
\begin{equation}
\begin{cases}
FIRST(S') = FIRST(S) = \{a, b\}, \\
FIRST(A) = \{a, b\}, \\
\end{cases}
\end{equation}
Вычислим множество ситуаций:
\begin{multline*}
I_1 = CLOSURE(\{[S' \rightarrow \cdot S, \$]\}) = \\
= \{[S' \rightarrow \cdot S, \$],
[S \rightarrow \cdot Ab, \$], [S \rightarrow \cdot Ac, \$], [A \rightarrow \cdot aA, b],
[A \rightarrow \cdot b, b], [A \rightarrow \cdot aA, c], [A \rightarrow \cdot b, c]\}
\end{multline*}
\begin{equation*}
GOTO(I_1, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_1, S) = CLOSURE(\{[S' \rightarrow S\cdot, \$]\}) = \{[S'\rightarrow S\cdot, \$]\} = I_2
\end{equation*}
\begin{equation*}
GOTO(I_1, A) = CLOSURE(\{[S \rightarrow A\cdot b, \$], [S \rightarrow A\cdot c, \$]\}) =
\{[S \rightarrow A\cdot b, \$], [S \rightarrow A\cdot c, \$]\} = I_3
\end{equation*}
\begin{multline*}
GOTO(I_1, a) = CLOSURE(\{[A \rightarrow a\cdot A, b], [A \rightarrow a\cdot A, c]\}) = \\
= \{[A \rightarrow a\cdot A, b], [A \rightarrow a\cdot A, c],
[A \rightarrow \cdot aA, b], [A \rightarrow \cdot b, b],
[A \rightarrow \cdot aA, c], [A \rightarrow \cdot b, c]\} = I_4
\end{multline*}
\begin{equation*}
GOTO(I_1, b) = CLOSURE(\{[A \rightarrow b\cdot, b], [A \rightarrow b\cdot, c]\}) =
\{[A \rightarrow b\cdot, b], [A \rightarrow b\cdot, c]\} = I_5
\end{equation*}
\begin{equation*}
GOTO(I_2, S) = GOTO(I_2, A) = GOTO(I_2, a) = GOTO(I_2, b) = GOTO(I_2, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_3, S) = GOTO(I_3, A) = GOTO(I_3, a) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_3, b) = CLOSURE(\{[S \rightarrow Ab\cdot, \$]\}) = \{[S \rightarrow Ab\cdot, \$]\} = I_6
\end{equation*}
\begin{equation*}
GOTO(I_3, c) = CLOSURE(\{[S \rightarrow Ac\cdot, \$]\}) = \{[S \rightarrow Ac\cdot, \$]\} = I_7
\end{equation*}
\begin{equation*}
GOTO(I_4, S) = GOTO(I_4, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_4, A) = CLOSURE(\{[A \rightarrow aA\cdot, b], [A \rightarrow aA\cdot, c]\}) =
\{[A \rightarrow aA\cdot, b], [A \rightarrow aA\cdot, c]\} = I_8
\end{equation*}
\begin{equation*}
GOTO(I_4, a) = CLOSURE(\{[A \rightarrow a\cdot A, b], [A \rightarrow a\cdot A, c]\}) = I_4
\end{equation*}
\begin{equation*}
GOTO(I_4, b) = CLOSURE(\{[A \rightarrow b\cdot, b], [A \rightarrow b\cdot, c]\}) = I_5
\end{equation*}
\begin{equation*}
GOTO(I_5, S) = GOTO(I_5, A) = GOTO(I_5, a) = GOTO(I_5, b) = GOTO(I_5, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_6, S) = GOTO(I_6, A) = GOTO(I_6, a) = GOTO(I_6, b) = GOTO(I_6, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_7, S) = GOTO(I_7, A) = GOTO(I_7, a) = GOTO(I_7, b) = GOTO(I_7, c) = \emptyset
\end{equation*}
\begin{equation*}
GOTO(I_8, S) = GOTO(I_8, A) = GOTO(I_8, a) = GOTO(I_8, b) = GOTO(I_8, c) = \emptyset
\end{equation*}
Построим таблицы ACTION и GOTO:
\begin{center}
\begin{tabular}{rllllrr}
\hline
Состояние & ACTION &  &  &  & GOTO & \\
 & a & b & c & \$ & S & A\\
\hline
1 & s4 & s5 &  &  & 2 & 3\\
2 &  &  &  & acc &  & \\
3 &  & s6 & s7 &  &  & \\
4 & s4 & s5 &  &  &  & 8\\
5 &  & r4 & r4 &  &  & \\
6 &  &  &  & r1 &  & \\
7 &  &  &  & r2 &  & \\
8 &  & r3 & r3 &  &  & \\
\hline
\end{tabular}
\end{center}
Рассмотрим работу автомата на слове \(\omega = abab\):
\begin{center}
\begin{tabular}{llll}
\hline
Стек & Прочитанная часть входа & Вход & Действие\\
\hline
1 &  & abab\$ & Считать {}<<a>>{}\\
1 4 & a & bab\$ & Считать {}<<b>>{}\\
1 4 5 & ab & ab\$ & Выдать ошибку\\
\hline
\end{tabular}
\end{center}
\section{Задача 6}
\label{sec:org5fb1620}
Заполнить таблицу Кока-Янгера-Касами для языка, заданного грамматикой \(G\) и выяснить, может
ли \(G\) порождать цепочку \(a + b * c\).
\begin{equation}
G = \{\{A, C, D\}, \{a, b, c, +, *\}, P, D\},
\end{equation}
где
\begin{equation}
\begin{cases}
D \rightarrow D + A | A \\
A \rightarrow A * C | C \\
C \rightarrow a | b | c
\end{cases}
\end{equation}
\subsection{Решение}
\label{sec:org14d41b9}
Для начала приведём грамматику к нормальной форме Хомского. Исходная грамматика уже не
содержит epsilon-продукций, но содержит цепные продукции \(D \rightarrow A\) и \(A \rightarrow C\).
Удалим эти продукции:
\begin{equation*}
\begin{cases}
D \rightarrow D + A | A \\
A \rightarrow A * C | C \\
C \rightarrow a | b | c
\end{cases}
\rightarrow
\begin{cases}
D \rightarrow D + A | A \\
A \rightarrow A * C | a | b | c \\
C \rightarrow a | b | c
\end{cases}
\rightarrow
\begin{cases}
D \rightarrow D + A | A * C | a | b | c \\
A \rightarrow A * C | a | b | c \\
C \rightarrow a | b | c
\end{cases}
\end{equation*}
Полученная грамматика не содержит бесполезных символов, поэтому путём введения новых переменных
получем нормальную форму Хомского для неё:
\begin{equation*}
\begin{cases}
D \rightarrow DR_D \\
D \rightarrow AR_A \\
D \rightarrow a \\
D \rightarrow b \\
D \rightarrow c \\
R_D \rightarrow PA \\
P \rightarrow + \\
R_A \rightarrow MC \\
M \rightarrow * \\
A \rightarrow AR_A \\
A \rightarrow a \\
A \rightarrow b \\
A \rightarrow c \\
C \rightarrow a \\
C \rightarrow b \\
C \rightarrow c
\end{cases}
\end{equation*}
Построим таблицу Кока-Янгера-Касами размера 5x5 для цепочки \(a+b*c\):
\begin{center}
\begin{tabular}{rlllll}
\hline
\(i\backslash j\) & 1 & 2 & 3 & 4 & 5\\
\hline
1 & \(\{D, A, C\}\) & \(\emptyset\) & \(\{D\}\) & \(\emptyset\) & \(\{D\}\)\\
2 &  & \(\{P\}\) & \(\{R_D\}\) & \(\emptyset\) & \(\{R_D\}\)\\
3 &  &  & \(\{D, A, C\}\) & \(\emptyset\) & \(\{A, D\}\)\\
4 &  &  &  & \(\{M\}\) & \(\{R_A\}\)\\
5 &  &  &  &  & \(\{D, A, C\}\)\\
\hline
\end{tabular}
\end{center}
В этой таблице \(T_{ij}\) -- множество нетерминалов, порождающих подцепочку цепочки \(a+b*c\),
начинающуюся с индекса \(i\) и заканчивающуюся индексом \(j\). Порядок заполнения таблицы:
\begin{enumerate}
\item Сначала заполняются диагональные ячейки: \(T_{ii}\) -- множество левых частей продукций вида \(P \rightarrow a_i\).
\item Далее заполняются ячейки \(T_{ij}, i < j\). Пусть заполнены ячейки \(T_{kj}, i < k \leq j\) и \(T_{im}, i \leq m < j\). Тогда построим множество \(L = \{PQ | P \in T_{ik}, Q \in T_{(k + 1)j}, k \in \overline{i, (j - 1)}\}\). Тогда \(T_{ij}\) -- множество левых частей продукций, правые части которых совпадают с элементами \(L\).
\end{enumerate}

Поскольку \(D \in T_{15}\), цепочка \(a+b*c\) принадлежит языку, порождаемому \(G\).
\end{document}
